Config/InformationRegisters/ExternalSystemIntegrationLogs.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ExternalSystemIntegrationLogs</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Request</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Response</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Description</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ExternalSystem</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ExternalSystemInteractions</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>FunctionName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>EventType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ExternalSystemEventTypes</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>UUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/IntegrationStatuses.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>IntegrationStatuses</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Success</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Warning</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Error</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/Integrations.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Integrations</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Accounting</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AleanCRS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AtolOnline</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Availpro</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Bitrix24</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Bonuses</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>BroniruiOnline</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DADATA</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ExternalLogSystem</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ExternalLoyaltySystem</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FIAS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Fitnes1C</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GuestJoy</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HAFELE</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Hotbot</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Hotel365</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Hotellab</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HotelOnlineBooking</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Hoteza</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HPG</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Igloorooms</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>iLocksOnline</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ISD</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JCCSmart</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JSON</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ordes</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OTAGateway</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Other</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PassportBoxREST</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>QRCodePaySberbank</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>rkeeper</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Roscongress</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RTK</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SamsungLYNK</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Sanatorium</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SelfService</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Siteminder</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SKK</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SKKV2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SquirrelPOS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Travelline</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ttLock</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>UHotels</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>UnisenderGO</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Wallet</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WebHotelier</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Wubook</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>YandexTV</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>YandexVision</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Guestlink</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/InformationRegisters/ExternalSystemIntegrationLogs/Ext/ManagerModule.bsl
#Region Public

// --------------------------------------------------------------------------------
//
// Parameters:
//  pData			 - Object - Data
//  pReceiverNode	 - IntegrationServices.DataExchangeInterfaces - Data exchange interfaces
//
Procedure ExchangePlansRecordChanges(pData, pReceiverNode = Undefined) Export
	// NOTHING SO FAR
EndProcedure // ExchangePlansRecordChanges

// --------------------------------------------------------------------------------
//  Procedure - Write log
//
// Parameters:
//  pExternalSystem	 - CtalogRef.ExternalSystemInteractions	 - Ref
//  pFunctionName	 - String								 - FunctionName
//  pEventType		 - Enums.ExternalSystemEventTypes		 - Enum ref
//  pRequest		 - String								 - Request
//  pResponse		 - String								 - Response
//  pDescription	 - String								 - Description
//  pMaxLogLength	 - Number								 - MaxLogLength
//  pUUID			 - 										 - UUID row
//  pTimestamp		 - Date									 - Timestamp
//
Procedure WriteLog(pExternalSystem, pFunctionName, pEventType, pRequest = Undefined, pResponse = Undefined, pDescription = Undefined, pMaxLogLength = 20000, pUUID="", pTimestamp = Undefined) Export
	
	If Not (ValueIsFilled(pExternalSystem) And ValueIsFilled(pFunctionName) And ValueIsFilled(pEventType)) Then
		Return;
	EndIf;
	
	vMaxLogLenght = pMaxLogLength; 
	If pExternalSystem.MaxLogLenght > vMaxLogLenght Then
		vMaxLogLenght = pExternalSystem.MaxLogLenght;
	ElsIf vMaxLogLenght = 0 Then
		vMaxLogLenght = 20000;
	EndIf;
	
	vRequest = "";
	If TypeOf(pRequest) = Type("Structure") Or TypeOf(pRequest) = Type("Map") Or TypeOf(pRequest) = Type("Array") Then
		vRequest = Catalogs.DataConvertationRules.MapToJSON(pRequest);
	Else
		vRequest = pRequest;
	EndIf;
	
	vResponse = "";
	If TypeOf(pResponse) = Type("Structure") Or TypeOf(pResponse) = Type("Map") Or TypeOf(pResponse) = Type("Array") Then
		vResponse = Catalogs.DataConvertationRules.MapToJSON(pResponse);
	Else
		vResponse = pResponse;
	EndIf;
	
	vDescription = "";
	If TypeOf(pDescription) = Type("Structure") Or TypeOf(pDescription) = Type("Map") Or TypeOf(pDescription) = Type("Array") Then
		vDescription = Catalogs.DataConvertationRules.MapToJSON(pDescription);
	Else
		vDescription = pDescription;
	EndIf;
	
	vRequest		= Left(vRequest, vMaxLogLenght);
	vResponse		= Left(vResponse, vMaxLogLenght);
	vDescription	= Left(vDescription, vMaxLogLenght);
	If IsBlankString(pUUID) Then
		pUUID		= String(New UUID());
	EndIf;
	
	If pTimestamp = Undefined Then
		pTimestamp = CurrentSessionDate();
	EndIf;
		
	vQuerry = New Query;
	vQuerry.Text = 
	"SELECT
	|	ExternalSystemInteractions.DataProcessor AS DataProcessor
	|FROM
	|	Catalog.ExternalSystemInteractions AS ExternalSystemInteractions
	|WHERE
	|	ExternalSystemInteractions.IsActive
	|	AND NOT ExternalSystemInteractions.DeletionMark
	|	AND ExternalSystemInteractions.Status = VALUE(Enum.IntegrationStatuses.Success)
	|	AND ExternalSystemInteractions.IntegrationType = VALUE(Enum.Integrations.ExternalLogSystem)
	|	AND NOT ExternalSystemInteractions.UseClient";
	vDataProcessors = vQuerry.Execute().Unload();
	
	vDataProcessor = Undefined;
	If vDataProcessors.Count() > 0 Then
		vDataProcessor = vDataProcessors[0].DataProcessor;
	EndIf;
	
	If vDataProcessor <> Undefined Then
		vDPO = Catalogs.DataProcessors.CreateDataProcessorByProcessing(vDataProcessor, True);
		If vDPO <> Undefined Then
			If vDPO.WriteLog(pTimestamp, vDescription, pExternalSystem, pFunctionName, pEventType, pUUID, vResponse, vRequest) Then
				Return;	
			EndIf;
		EndIf;
	EndIf;
		
	Try
		vRecMng					= InformationRegisters.ExternalSystemIntegrationLogs.CreateRecordManager();
		vRecMng.ExternalSystem	= pExternalSystem;
		vRecMng.FunctionName	= pFunctionName;
		vRecMng.EventType		= pEventType;
		vRecMng.Request			= vRequest;
		vRecMng.Response		= vResponse;
		vRecMng.Description		= vDescription;
		vRecMng.UUID			= pUUID;
		vRecMng.Period			= pTimestamp;

		vRecMng.Write(True);
	Except
		vErrParams = New Map();
		vErrParams.Insert("ExternalSystem", String(pExternalSystem));
		vErrParams.Insert("FunctionName", pFunctionName);
		vErrParams.Insert("EventType", String(pEventType));
		vErrParams.Insert("Request", vRequest);
		vErrParams.Insert("Response", vResponse);
		vErrParams.Insert("Description", vDescription);
		vErrParams.Insert("UUID", pUUID);
		vErrParams.Insert("Period", pTimestamp);
		vErrParams.Insert("Error", ErrorDescription());
		
		vErrJson = Catalogs.DataConvertationRules.MapToJSON(vErrParams);
		WriteLogEvent("WriteExternalSystemIntegrationLogs", EventLogLevel.Error, , , vErrJson);
	EndTry;
EndProcedure

#EndRegion

#Region FormEventHandlers

// --------------------------------------------------------------------------------
Procedure FormGetProcessing(pFormType, pParameters, pSelectedForm, pAdditionalInformation, pStandardProcessing)
	vQ = New Query;
	vQ.Text = 
	"SELECT
	|	ExternalSystemInteractions.Ref AS Ref
	|FROM
	|	Catalog.ExternalSystemInteractions AS ExternalSystemInteractions
	|WHERE
	|	NOT ExternalSystemInteractions.DeletionMark
	|	AND ExternalSystemInteractions.IsActive
	|	AND ExternalSystemInteractions.Status = VALUE(Enum.IntegrationStatuses.Success)
	|	AND ExternalSystemInteractions.IntegrationType = VALUE(Enum.Integrations.ExternalLogSystem)";
	If Not vQ.Execute().IsEmpty() Then
		pStandardProcessing = False;
		pSelectedForm = "ExternalDataSource.ExternalLogs.Table.ExternalLogs.ListForm";
	EndIf;                                             
EndProcedure // FormGetProcessing

#EndRegion
